Tekla Open API Reference for Tekla Structures 2025
Mark.Attributes Property
 Gets or sets the mark attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Mark.MarkAttributes Attributes { get; set; }
Public Property Attributes As Mark.MarkAttributes
	Get
	Set
Property Value
Type: Mark.MarkAttributes
See Also
Reference
Mark Class
Tekla.Structures.Drawing Namespace